<script setup>
</script>
<template>
  <section class="about">
    <h1 class="about__title">
      Онлайн-офлайн курси у Кременчуці по фронт-енд розробці
    </h1>
    <p>Привіт! Мене звати Ярослав, і я веб-розробник з досвідом роботи в галузі понад 4 років. Я з великим ентузіазмом представляю вам свої онлайн та офлайн курси з HTML, CSS, JavaScript та Vue.</p>

    <p>  Мої курси розроблені спеціально для студентів у віці від 15 років і старше, які проживають у місті Кременчуці. Протягом [вказати кількість] місяців ми разом пройдемо шлях від основ веб-розробки до більш складних концепцій та навичок.</p>

    <p>  Мої курси будуть проводитись у зручний для вас час, з [вказати дні тижня] з 19:00 до 20:00. Ми зіберемося [вказати місце проведення офлайн курсів], де ви зможете особисто спілкуватися зі мною та іншими студентами.</p>

    <p>  Що ви отримаєте, приєднавшись до моїх курсів? По-перше, я надам вам всі необхідні знання та інструменти для створення професійних веб-сайтів. Ми охопимо основи HTML та CSS, вивчимо потужні можливості JavaScript та розберемося з фреймворком Vue, який дозволить вам створювати інтерактивні та сучасні веб-додатки.</p>

    <p>  По-друге, я обіцяю вам персональну увагу та індивідуальну підтримку протягом всього курсу. Я завжди готовий відповісти на ваші питання та допомогти вам подолати будь-які труднощі, з якими ви можете зіткнутися.</p>

    <p>  Приєднуйтесь до мене у цій захоплюючій подорожі у світ веб-розробки! Зареє</p>
    <p class="about__sub-title">{{ $t("about__sub-title") }}</p>
    <p>{{ $t("about__sub") }}</p>
  </section>
</template>

<style lang="scss">
.about {
  p {
    line-height: 1.5;
  }

  h3,
  h4 {
    padding-top: 30px;
  }
}

.about__title {
  color: _palette(font, green);
  margin-bottom: _indents(small);
}

.about__sub-title {
  font-size: $font-size-medium;
  font-weight: bold;
  line-height: 30px;
  margin-bottom: _indents(small);
}
</style>
